###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/5b7bf024-e114-4d0e-a763-ae0821d10218/terraform-bin show -no-color tf.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.private_ec2[0] has changed
  ~ resource "aws_instance" "private_ec2" {
        id                                   = "i-0fe23b1542bc3a74e"
      ~ security_groups                      = [
          - "sg-044189d47020bb379",
        ]
        tags                                 = {
            "Name" = "project-WebServer-5"
        }
        # (30 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.private_ec2[1] has changed
  ~ resource "aws_instance" "private_ec2" {
        id                                   = "i-0db6c7912e9cc977c"
      ~ security_groups                      = [
          - "sg-0d37b210c0c8e64f1",
        ]
        tags                                 = {
            "Name" = "project-VM"
        }
        # (29 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.public_ec2[0] has changed
  ~ resource "aws_instance" "public_ec2" {
        id                                   = "i-0c346c7246f0cc7f4"
      ~ security_groups                      = [
          - "sg-0f7441af7ae57657d",
        ]
        tags                                 = {
            "App"   = "Web"
            "Build" = "terraform"
            "Name"  = "project-WebServer-1"
            "Owner" = "Kusal Thiwanka"
        }
        # (31 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.public_ec2[1] has changed
  ~ resource "aws_instance" "public_ec2" {
        id                                   = "i-04c71aeb0b5cc8a5c"
      ~ security_groups                      = [
          - "sg-0f7441af7ae57657d",
        ]
        tags                                 = {
            "App"   = "Web"
            "Build" = "terraform"
            "Name"  = "project-WebServer-2"
            "Owner" = "Kusal Thiwanka"
        }
        # (31 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.public_ec2[2] has changed
  ~ resource "aws_instance" "public_ec2" {
        id                                   = "i-0e17bcb58b36866a1"
      ~ security_groups                      = [
          - "sg-0f7441af7ae57657d",
        ]
        tags                                 = {
            "App"   = "Web"
            "Build" = "ansible"
            "Name"  = "project-WebServer-3"
            "Owner" = "Kusal Thiwanka"
        }
        # (30 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.public_ec2[3] has changed
  ~ resource "aws_instance" "public_ec2" {
        id                                   = "i-067e60ff5a1df6895"
      ~ security_groups                      = [
          - "sg-0f7441af7ae57657d",
        ]
        tags                                 = {
            "App"   = "Web"
            "Build" = "ansible"
            "Name"  = "project-WebServer-4"
            "Owner" = "Kusal Thiwanka"
        }
        # (30 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_key_pair.keypair has changed
  ~ resource "aws_key_pair" "keypair" {
        id          = "project_keypair"
      + tags        = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_instance.private_ec2[0] must be replaced
+/- resource "aws_instance" "private_ec2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:742286636198:instance/i-0fe23b1542bc3a74e" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0fe23b1542bc3a74e" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-09deba4be55c50483" -> (known after apply)
      ~ private_dns                          = "ip-10-1-5-105.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.5.105" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-044189d47020bb379",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "project-WebServer-5"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-044189d47020bb379",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-048c8a75e052cc25b" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.private_ec2[1] must be replaced
+/- resource "aws_instance" "private_ec2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:742286636198:instance/i-0db6c7912e9cc977c" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0db6c7912e9cc977c" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-04d9aec3efea0c362" -> (known after apply)
      ~ private_dns                          = "ip-10-1-6-223.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.6.223" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0d37b210c0c8e64f1",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "project-VM"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0d37b210c0c8e64f1",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-055377ba114cf56ee" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.public_ec2[0] must be replaced
+/- resource "aws_instance" "public_ec2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:742286636198:instance/i-0c346c7246f0cc7f4" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0c346c7246f0cc7f4" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-06aef37d49a084fb7" -> (known after apply)
      ~ private_dns                          = "ip-10-1-1-246.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.1.246" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "18.234.208.164" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0f7441af7ae57657d",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Build" = "terraform"
            "Name"  = "project-WebServer-1"
            "Owner" = "Kusal Thiwanka"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0f7441af7ae57657d",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-07dedbcfdcf685a78" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.public_ec2[1] must be replaced
+/- resource "aws_instance" "public_ec2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:742286636198:instance/i-04c71aeb0b5cc8a5c" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-04c71aeb0b5cc8a5c" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0e421df5c199fed7a" -> (known after apply)
      ~ private_dns                          = "ip-10-1-2-40.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.2.40" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "34.234.95.53" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0f7441af7ae57657d",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Build" = "terraform"
            "Name"  = "project-WebServer-2"
            "Owner" = "Kusal Thiwanka"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0f7441af7ae57657d",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-059f1c9336609bff0" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.public_ec2[2] must be replaced
+/- resource "aws_instance" "public_ec2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:742286636198:instance/i-0e17bcb58b36866a1" -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0e17bcb58b36866a1" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0e720029d353eabe6" -> (known after apply)
      ~ private_dns                          = "ip-10-1-3-27.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.3.27" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "34.229.241.143" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0f7441af7ae57657d",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Build" = "ansible"
            "Name"  = "project-WebServer-3"
            "Owner" = "Kusal Thiwanka"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0f7441af7ae57657d",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0ee2f0f547ebe6748" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.public_ec2[3] must be replaced
+/- resource "aws_instance" "public_ec2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:742286636198:instance/i-067e60ff5a1df6895" -> (known after apply)
      ~ availability_zone                    = "us-east-1d" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-067e60ff5a1df6895" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0492dafc836d7d610" -> (known after apply)
      ~ private_dns                          = "ip-10-1-4-36.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.4.36" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "44.202.222.190" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0f7441af7ae57657d",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Build" = "ansible"
            "Name"  = "project-WebServer-4"
            "Owner" = "Kusal Thiwanka"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0f7441af7ae57657d",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-082a1aad5c3659d8f" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  ~ private_vm_ips         = "10.1.6.223" -> (known after apply)
  ~ private_webservers_ips = "10.1.5.105" -> (known after apply)
  ~ public_vm_ids          = [
      - "i-0c346c7246f0cc7f4",
      - "i-04c71aeb0b5cc8a5c",
      - "i-0e17bcb58b36866a1",
      - "i-067e60ff5a1df6895",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ public_vm_ips          = [
      - "34.229.241.143",
      - "44.202.222.190",
      + (known after apply),
      + (known after apply),
    ]
  ~ public_webservers_ips  = [
      - "18.234.208.164",
      - "34.234.95.53",
      + (known after apply),
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_instance.private_ec2[0] has changed%0A  ~ resource "aws_instance" "private_ec2" {%0A        id                                   = "i-0fe23b1542bc3a74e"%0A      ~ security_groups                      = [%0A          - "sg-044189d47020bb379",%0A        ]%0A        tags                                 = {%0A            "Name" = "project-WebServer-5"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.private_ec2[1] has changed%0A  ~ resource "aws_instance" "private_ec2" {%0A        id                                   = "i-0db6c7912e9cc977c"%0A      ~ security_groups                      = [%0A          - "sg-0d37b210c0c8e64f1",%0A        ]%0A        tags                                 = {%0A            "Name" = "project-VM"%0A        }%0A        # (29 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.public_ec2[0] has changed%0A  ~ resource "aws_instance" "public_ec2" {%0A        id                                   = "i-0c346c7246f0cc7f4"%0A      ~ security_groups                      = [%0A          - "sg-0f7441af7ae57657d",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Build" = "terraform"%0A            "Name"  = "project-WebServer-1"%0A            "Owner" = "Kusal Thiwanka"%0A        }%0A        # (31 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.public_ec2[1] has changed%0A  ~ resource "aws_instance" "public_ec2" {%0A        id                                   = "i-04c71aeb0b5cc8a5c"%0A      ~ security_groups                      = [%0A          - "sg-0f7441af7ae57657d",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Build" = "terraform"%0A            "Name"  = "project-WebServer-2"%0A            "Owner" = "Kusal Thiwanka"%0A        }%0A        # (31 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.public_ec2[2] has changed%0A  ~ resource "aws_instance" "public_ec2" {%0A        id                                   = "i-0e17bcb58b36866a1"%0A      ~ security_groups                      = [%0A          - "sg-0f7441af7ae57657d",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Build" = "ansible"%0A            "Name"  = "project-WebServer-3"%0A            "Owner" = "Kusal Thiwanka"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.public_ec2[3] has changed%0A  ~ resource "aws_instance" "public_ec2" {%0A        id                                   = "i-067e60ff5a1df6895"%0A      ~ security_groups                      = [%0A          - "sg-0f7441af7ae57657d",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Build" = "ansible"%0A            "Name"  = "project-WebServer-4"%0A            "Owner" = "Kusal Thiwanka"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_key_pair.keypair has changed%0A  ~ resource "aws_key_pair" "keypair" {%0A        id          = "project_keypair"%0A      + tags        = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A+/- create replacement and then destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.private_ec2[0] must be replaced%0A+/- resource "aws_instance" "private_ec2" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:742286636198:instance/i-0fe23b1542bc3a74e" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1a" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-0fe23b1542bc3a74e" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-09deba4be55c50483" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-5-105.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.5.105" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-044189d47020bb379",%0A        ]%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "Name" = "project-WebServer-5"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-044189d47020bb379",%0A        ] -> (known after apply)%0A        # (10 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      ~ cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          ~ core_count       = 1 -> (known after apply)%0A          ~ threads_per_core = 1 -> (known after apply)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + tags_all              = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_protocol_ipv6          = "disabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ delete_on_termination = true -> (known after apply)%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ encrypted             = false -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          + kms_key_id            = (known after apply)%0A          ~ tags                  = {} -> (known after apply)%0A          ~ tags_all              = {} -> (known after apply)%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-048c8a75e052cc25b" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.private_ec2[1] must be replaced%0A+/- resource "aws_instance" "private_ec2" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:742286636198:instance/i-0db6c7912e9cc977c" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1b" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-0db6c7912e9cc977c" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-04d9aec3efea0c362" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-6-223.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.6.223" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-0d37b210c0c8e64f1",%0A        ]%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "Name" = "project-VM"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-0d37b210c0c8e64f1",%0A        ] -> (known after apply)%0A        # (9 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      ~ cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          ~ core_count       = 1 -> (known after apply)%0A          ~ threads_per_core = 1 -> (known after apply)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + tags_all              = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_protocol_ipv6          = "disabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ delete_on_termination = true -> (known after apply)%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ encrypted             = false -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          + kms_key_id            = (known after apply)%0A          ~ tags                  = {} -> (known after apply)%0A          ~ tags_all              = {} -> (known after apply)%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-055377ba114cf56ee" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.public_ec2[0] must be replaced%0A+/- resource "aws_instance" "public_ec2" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:742286636198:instance/i-0c346c7246f0cc7f4" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1a" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-0c346c7246f0cc7f4" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "running" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-06aef37d49a084fb7" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-1-246.ec2.internal" -> (known after apply)%0A      ~ private_ip   
  ```
  </details>
  *Pusher: @KusalThiwanka, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Deploy`*